app/controllers/greetings_controller.rb

SELECT "greetings".* FROM "greetings" WHERE "greetings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def index
    greeting = Greeting.find_by(id: rand(1..Greeting.count))